# Используем официальный образ Python в качестве базового
FROM python:3.11-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл с зависимостями в рабочую директорию
COPY requirements.txt .

# Устанавливаем зависимости
# --no-cache-dir: отключает кэш, что уменьшает размер образа
# -r requirements.txt: указывает файл для установки
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь остальной код приложения в рабочую директорию
COPY . .

# Команда для запуска приложения
CMD ["uvicorn", "App.main:app", "--host", "0.0.0.0", "--port", "8000"]